```
Terraform will perform the following actions:

  # azurerm_storage_share.ldap will be created
  + resource "azurerm_storage_share" "ldap" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "ldap"
      + quota                = 5120
      + resource_manager_id  = (known after apply)
      + storage_account_name = "ldapjenkinsiobackups"
      + url                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```